title: PIKABOT INFECTION WITH COBALT STRIKE
status: experimental
description: This rule will detect the persistence of an pikabot infection with Cobalt Strike. The rule will detect registry entries with base64 encoded values. 
author: Alan Staciluaskas
date: October 13, 2023
references:
  - https://www.malware-traffic-analysis.net/2023/10/03/index.html
logsource:
product: windows
    category: registry_set
detection:
  selection:
      TargetObject|contains: 'HKCU\Sofware\Microsoft\podogyniu'
  selection1:
	  TargetObject|base64: /^(?:[A-Za-z0-9+/]{4})*(?:[A-Za-z0-9+/]{2}==|[A-Za-z0-9+/]{3}=)?$/<br />
  condition: selection and selection1
falsepositives:
  - Unknown
level: high
tags:<br />
  - attack.modify_registry
  - attack.t1112
